{"convertedBy": "TensorFlow.js Converter v1.4.0", "format": "layers-model", "generatedBy": "keras v2.2.4-tf", "modelTopology": {"training_config": {"optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "decay": 0.0, "learning_rate": 0.0010000000474974513, "name": "Adam", "beta_1": 0.8999999761581421, "amsgrad": false, "epsilon": 1e-07}}, "weighted_metrics": null, "metrics": ["accuracy"], "loss_weights": null, "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "batch_input_shape": [null, 28, 28], "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "name": "dense"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "name": "dense_1"}}], "name": "sequential"}}}, "weightsManifest": [{"weights": [{"shape": [784, 128], "name": "dense/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense/bias", "dtype": "float32"}, {"shape": [128, 10], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}]}